backend/app/views/book_creator/preview_text.html.erb

  flashvars = {
    title: '<%=j current_user.template_title %>',
    text: '<%=j current_user.template_text %>',
    text_layout: <%= @templates.first.text_id %>
---
SELECT "text_templates".* FROM "text_templates" WHERE (287 >= min_text and 287 <= max_text)