backend/app/controllers/book_creator_controller.rb

UPDATE "users" SET "template_picture" = 'testImage_.jpg', "template_text" = 'Bacon ipsum dolor sit amet tri-tip bresaola bacon sirloin pork belly beef venison, brisket pork frankfurter. Tongue ground round chicken, sirloin meatball fatback pastrami ham bresaola venison ribeye. Pig chicken jerky drumstick andouille, hamburger ground round sausage flank fatback salami turducken pork. Shank short ribs strip steak t-bone, tail spare ribs jowl shankle venison rump leberkäse. Swine cow prosciutto chuck, brisket short ribs salami bacon tail meatloaf rump ham boudin sausage. Biltong meatball shank tongue, tri-tip cow chicken sausage bacon ribeye brisket capicola pastrami shoulder tail. Drumstick flank filet mignon, chuck sausage pork cow tail salami corned beef.
SELECT "templates".* FROM "templates" ORDER BY created_at LIMIT 1
SELECT "templates".* FROM "templates" WHERE "templates"."id" = ? LIMIT 1  [["id", "3"]]
SELECT "templates".* FROM "templates"
SELECT "users".* FROM "users" WHERE "users"."template_id" IN (1, 2, 3, 4, 5, 6, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17)
---
  def preview
    unless params['user'].nil?
      current_user.template_picture = params['user']['template_picture']
      current_user.template_text = params['user']['template_text']
      current_user.template_title = params['user']['template_title']
      current_user.save
    end

    @templates = Template.order('created_at')#.all(:include => :user).delete_if {|t| not (t.user.nil? || t.user == current_user)}

    #Did the user select a template?
    unless params['template'].nil?
      @template = Template.find(params['template'])
    else
      @template = current_user.template
    end

    # Pick a random one...
    @template ||= @templates.first

SELECT "text_templates".* FROM "text_templates" WHERE (287 >= min_text and 287 <= max_text)
SELECT "text_templates".* FROM "text_templates" WHERE "text_templates"."id" IS NULL LIMIT 1
---
  def preview_text
    @image = current_user.image_url
    @thumb = current_user.thumb_url

    #Text templates
    text_size = 0
    text_size += current_user.template_title.size rescue 0
    text_size += current_user.template_text.size rescue 0
    text_size /= 10 #word count approximate
    puts "text_size is #{text_size}"
    @templates = TextTemplate.find :all, :conditions => ["? >= min_text and ? <= max_text", text_size, text_size]

UPDATE "users" SET "remember_created_at" = NULL, "updated_at" = '2011-11-07 15:03:32.749460' WHERE "users"."id" = 1
---
  def save_image
    begin
      current_user.update_image request.body.read

UPDATE "users" SET "text_template_id" = 9, "updated_at" = '2012-01-09 18:13:12.860761' WHERE "users"."id" = 1
---
  def save_text_template
    current_user.text_template_id = params['id']
    current_user.save