backend/app/controllers/home_controller.rb

  def index
    @user = User.all(order: 'name')
---
SELECT "users".* FROM "users" ORDER BY name